[{"title":"The Evolution of Argarak's Nexus","published":true,"tags":["Nexus"],"published_date":"2016-04-28T23:00:00.000Z","permalink":"/2016/04/29/nexus-evolution","last_modified":"2016-05-01T14:43:20.412Z","content":"Argarak's Nexus has has drastically evolved in a short period of time (approximately one year). Let's take a look back at what Argarak's Nexus was.\n\n## The name\n\nI took the name Argarak as an alias because it is a ship captain name of the Ilwrath species in the game Star Control 2, which is one of my favourite games of all time. (Though Heroes of Might and Magic III is the best)\n\nNexus was just a word which I picked out from a thesaurus. After searching the word \"network\", I found the word \"nexus\", which was appealing to me - even though my website is not a network. (except only in the sense that it is a network of all the rubbish I make, not a literal network).\n\n## Version 0\n\nI always wanted a website of my own. Not really for any particular purpose, other than to put all of my future projects on it. However, there were always difficulties. I did not know HTML or CSS too well, and I did not know any practical javascript. Buying a domain name and hosting wasn't too appealing since I did not want to waste money on some website no-one is going to visit. However, I can always make a prototype on my computer!\n\nHowever, before any real development, I decided to make an image of what I wanted the website to look. I used Inkscape to create the image and it somewhat looks similar - but a lot worse - to what it looks today. So let's take a look at it!\n\n![website image](/images/argarak_idea.png)\n\nNow that's awful design! Post warning, many of these images on this post are going to be quite bad in design. Sorry if it makes you cringe. Anyway, As you can see, the sidebar style that version 2 has is present in this image. I've always wanted to make a website with a sidebar for some reason. Frankly, I do not remember fully what those icons meant. I only remember that the top one is the old Nexus logo (I'll get on to that...), the person icon is probably an about page, the gears are most likely some kind of programs repository and the \"play\" icon is probably about videos or something.\n\nAs you will see later, pre-release version 2 had the same top bar. It's interesting how I've kept a similar design over the year.\n\nFinally development began. Back then, in 2015, I used the Netbeans IDE for my programming needs. It wasn't very good and had many problems. Also, at the time, I used to love this website called [COLOURlovers](http://www.colourlovers.com/), which had collections of various patterns which I used commonly for my websites. Now, they are too colourful and garish for me to use these days, but back then I always liked to use the background-image element on just about all my tags.\n\nSo here's how it went!\n\n![version 0](/images/v0.png)\n\nSadly, I could not find a source of this website, I could have used it as a basis for another, which I will show soon. Anyway, there are many design flaws with the design. The most obvious one would be the inconsistency of the patterns. The website is light coloured, which is not my style anymore, the text on the backgrounds is difficult to read and it's too detailed and has no set palette.\n\nThe links on the top blend in to the background too much, therefore are difficult to see and the font sizes are too large and inconsistent. It's not a great website, to say the least.\n\nAs you can read at the bottom of the image, I was wanting to learn practical javascript however, I did not know JQuery so that's probably why (and yes there are built in ID searching and style setting functions but JQuery is so much easier).\n\nI believe that this next image is the website that I based this one on. Here's how it looks:\n\n![based on version 0](/images/v0b.png)\n\nAt least with this one the links are easy to read. However, they are too large. The whole site is pretty much empty and abandoned.\n\nThe logo at the top is the same logo we saw earlier, but this time with curly brackets, for no good reason whatsoever. And I licensed it by the GPL because a ~40 odd line HTML file and a CSS file of approximately the same size should be licensed by a strong copyleft license, because why not! \n\nBy the way, these are from 2015! I'm amazed the amount of progress I made with my website, it really amazing to see how terrible websites can eventually become good ones. \n\nActually, at the time, I did not refer to these sites as Argarak's Nexus, the source for the most recent one shown was called \"some_website\".\n \nOf course, I made many little abandoned blogs (i.e [https://argarak.wordpress.com](https://argarak.wordpress.com)) but I will not cover them because they are pretty boring and not very progressive of the Nexus we have today.\n\n<hr> \n \nI have been interested in secure and private providers of email, and so I went over to [prism-break](https://prism-break.org/en/) and went over to the Email Accounts section of the site and I found the group Autistici/Inventiati who provided many kinds of services, but my main goal was to finally break away from Google Mail and my spam-filled email account to a safer, private and trustworthy provider. So I signed up, sent them a request and they accepted it! Which was great. \n\nI don't use email often, especially for domestic communications, but without it, it would be difficult to contact developers, make accounts and use or subscribe to mailing lists.\n\nAnyway, I heard that A/I were offering a blogging service, which was intriguing, so I set one up. The service was called \"Noblogs\" and I chose the URL \"nexus.noblogs.org\". Version 1 has began.\n\n## Version 1\n\nI never really liked Wordpress myself. It's interface is clunky, customisation is weak (client side) - in the sense that the only thing you can change is the CSS of the website - and server side, it's really confusing for me. The themes are made in PHP for some reason.\n\nI also don't like how you can only create posts with the use of some awful GUI.\n\nHowever, it is very easy to set up - especially compared to Jekyll.\n\nHere's how the design looked, with the twenty-eleven theme:\n\n![version 1](/images/v1.png)"}]
